Autodesk.Revit.DB.FabricationPart.RotateConnectedPartByConnector(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Connector,System.Double)
Rotates a connected fabrication part around the axis of the specified connector.
Remarks:
Attempts to resize rectangular and oval ends if the angle is a multiple of PI/2.
Taps cannot be rotated.
For rectangular and oval profiles only 90, 180 and 270 degree rotations are valid.
doc:
The document.
conn:
The connected connector of the fabrication part to be rotated.
axisRotationBy:
The angle in radians to rotate by.
Throws Autodesk.Revit.Exceptions.ArgumentException:
For rectangular and oval parts the axis rotation must be a multiple of PI/2.
-or-
The connector does not belong to a fabrication part.
-or-
Connector is not connected.
-or-
Connector belongs to a fabrication part tap.
-or-
Fabrication part cannot be rotated because it is either unable to be re-sized or it is too constrained.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
rotate failed because the fabrication part geometry could not be modified accordingly.
Since:
2016 Subscription Release

Autodesk.Revit.DB.FabricationPart.PlaceFittingAsCutIn(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Connector,System.Double)
Places the fitting on the straight part by cut in, use the fitting's focal point as the insertion position.
doc:
The document.
straightId:
Id of the straight to be cut in.
fittingId:
Id of the fitting to cut in.
position:
The position to cut in the straight.
fittingConn:
The connector of the fitting to align with the primary connector of the straight part.
axisRotation:
Rotation around the direction of connection - angle between width vectors in radians.
Returns:
True if cuts in successfully.
Throws Autodesk.Revit.Exceptions.ArgumentException:
For rectangular and oval parts the axis rotation must be a multiple of PI/2.
-or-
fittingConn is not a connector of the fitting.
-or-
fittingConn is not valid, it is not within a pair connector for cutting in.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to align fitting to the straight to cut in.
-or-
There is no enough room in the run for cut in.
Since:
2017

Autodesk.Revit.DB.FabricationPart.PlaceAsTap(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector,System.Double,System.Double,System.Double)
Places the part by its connector to a specific position on the straight part at the specified distance from the host part connector.
Remarks:
Tap cannot be placed if it is already connected.
doc:
The document.
tapPartConn:
The connector of the part to place.
hostPartConn:
The connector of host part.
distance:
The distance to host part connector where to place the part.
axisRotation:
The axis rotation in radians.
secondaryAxisRotation:
The secondary axis rotation in radians.
Throws Autodesk.Revit.Exceptions.ArgumentException:
It is not a valid part to place as tap.
-or-
Tap should be placed on straight part.
-or-
The distance is out of range.
-or-
For rectangular and oval parts the axis rotation must be a multiple of PI/2.
-or-
Invalid tap for host's profile type.
-or-
The fabrication part is connected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
tap is not connected by its primary connector.
Throws Autodesk::Revit::Exceptions::InvalidOpertationException:
tap does not fit on the host.
Since:
2016

Autodesk.Revit.DB.FabricationPart.RotateConnectedTap(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationPart,System.Double,System.Double)
Rotates a connected fabrication tap by the specified angles about the primary and secondary axis.
doc:
The document.
tap:
The connected fabrication part tap to rotate.
primaryAxisRotateBy:
The primary axis rotation angle in radians to rotate by.
secondaryAxisRotateBy:
The secondary axis rotation angle in radians to rotate by.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Is not connected as a fabrication part tap.
-or-
tap cannot be rotated about the primary axis by the specified angle: primaryAxisRotateBy
-or-
tap cannot be rotated about the secondary axis by the specified angle: secondaryAxisRotateBy
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016 Subscription Release

Autodesk.Revit.DB.FabricationPart.AlignPartByConnectors(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector,System.Double)
Moves fabrication part by one of its connectors and aligns it to another connector.
doc:
The document.
partConn:
The connector of the fabrication part to move and align by.
toConn:
The connector of the fabrication part or family to align to.
axisRotation:
Rotation around the direction of connection - angle between width vectors in radians.
Returns:
True if alignment succeeds, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
For rectangular and oval parts the axis rotation must be a multiple of PI/2.
-or-
The connector does not belong to a fabrication part.
-or-
The fabrication part is connected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.FabricationPart.ConnectAndCouple(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector)
Makes a connection between the specified connectors and adds coupling if necessary.
Remarks:
This function does not place and align the fabrication part. Call AlignPartByConnectors before connecting.
doc:
The document.
partConn:
The connector of the fabrication part.
toConn:
The connector of the fabrication part or family to connect to.
Returns:
True if connection succeeded, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The connector does not belong to a fabrication part.
-or-
The fabrication part connectors are not aligned, call AlignPartByConnectors to align them.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.FabricationPart.SplitStraight(Autodesk.Revit.DB.XYZ)
Splits the straight into two at the passed in point.
position:
The position to split in the straight.
Returns:
Returns the ElementId of the new straight.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The position is not on the straight.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The part is not a straight.
Since:
2018

Autodesk.Revit.DB.FabricationPart.SplitStraight(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ)
Splits the straight into two at the passed in point.
document:
The document.
partId:
Id of the straight to split.
position:
The position to split in the straight.
Returns:
Returns the ElementId of the new straight.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The part is not a straight.
-or-
The position is not on the straight.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationPart.Reposition(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Repositions the fabrication straight part to another end of the run.
doc:
The document.
partId:
Id of the fabrication part to reposition.
Throws Autodesk.Revit.Exceptions.ArgumentException:
It is not a straight segment on the end in the run.
-or-
There are locked parts in the run.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
this operation failed.
Since:
2017

Autodesk.Revit.DB.FabricationPart.OptimizeLengths(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Optimizes the length fabrication straight parts.
doc:
The document.
partIds:
The ids of the fabrication parts in a selected fabrication part run.
Returns:
New and modified fabrication part ids in the optimize
Throws Autodesk.Revit.Exceptions.ArgumentException:
There are no straight parts to optimize, or all parts are locked or locked by group membership.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
this operation failed.
Since:
2016

Autodesk.Revit.DB.FabricationPart.AdjustEndLength(Autodesk.Revit.DB.Connector,System.Double,System.Boolean)
Adjusts the length for the specified connector.
partConn:
# The connector of the fabrication part to adjust length.
lengthToAdjust:
The length to adjust.
totalLengthOnly:
True if adjust the total length only when adjust length.
Returns:
The adjusted length.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The end of the fabrication part of the connector can not be adjusted.
-or-
Connector is connected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.FabricationPart.CanAdjustEndLength(Autodesk.Revit.DB.Connector)
Checks if the end of fabrication part can be adjusted.
partConn:
# The connector of the fabrication part to adjust length.
Returns:
True if the end of fabrication part can be adjusted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.FabricationPart.StretchAndFit(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Fabrication.FabricationPartRouteEnd,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId}@)
Stretch the fabrication part from the specified connector and fit to the target routing end.
Remarks:
Cannot stretch and fit fabrication part straight, tap or hanger.
document:
The document in which to perform the stretch and fit.
stretchConnector:
The connector of the fabrication part to be stretched.
target:
The target routing end to align and fit to.
newPartIds:
New fabrication part element identifiers.
Returns:
Returns FabricationPartFitResult::Success if successful.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Connector does not belong to a fabrication part with a valid fabrication service.
-or-
Connector is connected.
-or-
Connector belongs to a fabrication part straight, tap or hanger.
-or-
routing end is valid to route to.
-or-
stretch target end type must be a supported type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
fabrication part is not connected at one end only.
-or-
cannot stretch fabrication part to a different service.
Since:
2017

Autodesk.Revit.DB.FabricationPart.CreateHanger(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationServiceButton,System.Int32,Autodesk.Revit.DB.ElementId)
Creates a free placed hanger.
document:
The document.
button:
The fabrication service button to use.
condition:
The condition index. If the button has multiple conditions.
levelId:
The level identifier associated with the level.
Returns:
The newly-created fabrication hanger.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Invalid fabrication service button.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index condition is not larger or equal to 0 and less than ConditionCount
Since:
2017

Autodesk.Revit.DB.FabricationPart.CreateHanger(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationServiceButton,System.Int32,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Connector,System.Double,System.Boolean)
Creates a hanger on the fabrication part.
document:
The document.
button:
The fabrication service button to use.
condition:
The condition index. If the button has multiple conditions.
hostId:
The host part id. The host should be one horizontal straight part.
hostConnector:
The connector of the host.
distance:
The distance from the input connector of the host part. Units are in feet (ft).
attachToStructure:
Attach to the nearest structural element. The structural element might be one of Floor/Roof/Stair/Structural Framing.
Returns:
The newly-created fabrication hanger.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Hangers may only be placed on straight horizontal fabrication segments and some kind of fittings.
-or-
Invalid fabrication service button.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index condition is not larger or equal to 0 and less than ConditionCount
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
the distance is out of range.
-or-
cannot find suitable fabrication part for the host.
-or-
cannot place hanger on the host.
Since:
2016

Autodesk.Revit.DB.FabricationPart.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationServiceButton,System.Int32,Autodesk.Revit.DB.ElementId)
Creates a fabrication part element based on button.
document:
The document.
button:
The fabrication service button to use.
condition:
The condition index.
levelId:
The element identifier associated with the Autodesk.Revit.DB.Level
the Autodesk.Revit.DB.FabricationPart will be created on.
Returns:
The new fabrication part.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Fabrication service button contains invalid fittings.
-or-
Please use FabricationPart.CreateHanger to create fabrication hanger.
-or-
The ElementId levelId is not a Level.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index condition is not larger or equal to 0 and less than ConditionCount
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The fabrication part type does not exist. Reload the service using FabricationConfiguration.LoadServices.
Since:
2016